Revit 2027 API
ParameterTypeId.FamilyCurveAttachmentProportion Property
 "Attachment Point"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyCurveAttachmentProportion { get; }
Public Shared ReadOnly Property FamilyCurveAttachmentProportion As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyCurveAttachmentProportion {
	ForgeTypeId^ get ();
}
static member FamilyCurveAttachmentProportion : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace